In [23]:
import pandas as pd
import numpy as np

In [2]:
data={'name':['anu','neenu','vinu','sanu'],
      'age':[20,21,14,13]}
df=pd.DataFrame(data)

df['voting eligibility'] = ['eligible' if age > 18 else 'not eligible' for age in df['age']]
df

    name  age voting eligibility
0    anu   20           eligible
1  neenu   21           eligible
2   vinu   14       not eligible
3   sanu   13       not eligible

In [14]:
original_data=pd.Series([100,200,'python',300.12,400])
print(original_data)
data=pd.Series(['hello'])
new_data=original_data.append(data)
print(new_data)

0       100
1       200
2    python
3    300.12
4       400
dtype: object
0       100
1       200
2    python
3    300.12
4       400
0     hello
dtype: object

C:\Users\Dell\AppData\Local\Temp\ipykernel_7496\2701252432.py:4: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  new_data=original_data.append(data)

In [11]:
data={'Name':['Sivani','Fahma','Shahana','Hadhiya'],
      'Age':[12,13,14,15],
      'Class':[7,6,8,9]}
df=pd.DataFrame(data)
order=['Class','Age','Name']
df=df[order]
df

   Class  Age     Name
0      7   12   Sivani
1      6   13    Fahma
2      8   14  Shahana
3      9   15  Hadhiya

In [15]:
d={"city":["California","Georgia","Los Angeles","California","Georgia","Los Angeles"] ,"people":[4,2,4,4,2,4]}
df=pd.DataFrame(d)
city_people=df.groupby('city')['people'].sum()
print(city_people)

city
California     8
Georgia        4
Los Angeles    8
Name: people, dtype: int64

In [19]:
a=pd.Series([1,2,3,4])
b=pd.Series([5,6,7,8])
add=a+b
sub=a-b
mul=a*b
div=a/b
df=pd.DataFrame({
    'First':a,
    'Second':b,
    'Add':add,
    'Sub':sub,
    'Mul':mul,
    'Div':div
})
df

   First  Second  Add  Sub  Mul       Div
0      1       5    6   -4    5  0.200000
1      2       6    8   -4   12  0.333333
2      3       7   10   -4   21  0.428571
3      4       8   12   -4   32  0.500000

In [22]:
s1=pd.Series([5,7,3,9,1])
s2=pd.Series(sorted(s1.values))
print(s2)

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [29]:
data={'name': ['Asha', 'Radha', 'Kamal', 'Divy', 'Anjali'], 
      'height': [ 5.5, 5, np.nan, 5.9, np.nan],
      'age': [11, 23, 22, 33, 22]}
df=pd.DataFrame(data)
row=df[df['height'].isna()]
row

     name  height  age
2   Kamal     NaN   22
4  Anjali     NaN   22

In [31]:
data = {'Manasvi': ['Physics', 'Chemistry', 'English', 'Maths', 'Computer Sc'], 
        'marks': [ 89,99,97,99,98],}
df=pd.DataFrame(data)
sum_=df['marks'].sum()
print(sum_)

482

In [36]:
data={'Name':['Sivani','Fahma','Shahana'],
      'Roll num':[33,34,35],
      'English':np.random.randint(50,100,size=3),
      'Malayalam':np.random.randint(50,100,size=3),
      'Hindi':np.random.randint(50,100,size=3),
      'Maths':np.random.randint(50,100,size=3),
      'Science':np.random.randint(50,100,size=3)}
df=pd.DataFrame(data)
df['Percentage'] = df[['English','Malayalam','Hindi','Maths','Science']].mean(axis=1)
df

      Name  Roll num  English  Malayalam  Hindi  Maths  Science  Percentage
0   Sivani        33       97         68     54     74       69        72.4
1    Fahma        34       63         92     51     57       80        68.6
2  Shahana        35       81         55     58     51       52        59.4